<?php
// Heading
$_['heading_title']          	= 'Мастер-классы - Настройки';
$_['heading_title_size']          	= 'Размеры изображений';
$_['heading_title_limit']          	= 'Лимит вывода материалов';
$_['heading_title_banner']          	= 'Баннер в журнале';
$_['heading_title_telegram']          	= 'Telegram в журнале';

// Text
$_['text_success']          	= 'Изменения успешно внесены!';
$_['text_list']          		= 'Список материалов';
$_['text_add']          		= 'Добавление материала';
$_['text_edit']          		= 'Редактирование материала';
$_['text_default']          	= 'Основной магазин';

// Column
$_['column_title']          	= 'Заголовок материала';
$_['column_sort_order']         = 'Порядок сортировки';
$_['column_action']          	= 'Действие';

// Tab
$_['tab_meta']          	= 'Meta';
$_['tab_master']         = 'Мастер-классы';

// Entry
$_['entry_meta_description']      = 'Текст:';
$_['entry_bread']          = 'Заголовок';
$_['entry_meta_title']          = 'HTML-тег Title';
$_['entry_meta_h1']             = 'Заголовок H1';
$_['entry_meta_keyword']        = 'Мета-тег Keywords:';
$_['entry_meta_description']    = 'Мета-тег Description:';


$_['entry_date_available']          		= 'Дата публикации:';
$_['entry_title']          		= 'Заголовок:';
$_['entry_description']         = 'Описание:';
$_['entry_store']          		= 'Магазины:';
$_['entry_banner']          		= 'Баннер:';
$_['entry_link']          		= 'Ссылка:';
$_['entry_text']          		= 'Текст:';
$_['entry_button']          		= 'Кнпока:';

$_['entry_keyword']          	= 'SEO URL:';
$_['entry_bottom']          	= 'Отображать в футере:';
$_['entry_status']          	= 'Статус:';
$_['entry_sort_order']          = 'Порядок сортировки:';
$_['entry_layout']          	= 'Выберите макет:';
$_['entry_image']          	= 'Изображение:';

// Help
$_['help_keyword']          	= 'Используйте тире вместо пробелов. Должно быть уникально на всю систему';
$_['help_bottom']          		= 'Показать в футере';

// Error
$_['error_warning']          	= 'Внимательно проверьте форму на ошибки!';
$_['error_permission']          = 'У вас нет прав для изменения статей!';
$_['error_bread']          		= 'Укажите заголовок';
$_['error_meta_h1']          		= 'Укажите H1';
$_['error_title']          		= 'Заголовок статьи должно быть от 3 до 64 символов!';
$_['error_description']         = 'Описание должно быть не менее 3 символов!';
$_['error_meta_title']          = 'Мета-тег Title должен быть от 3 до 255 символов!';
$_['error_keyword']          	= 'Этот SEO keyword уже используется!';
$_['error_account']          	= 'Эту страницу нельзя удалить, поскольку она назначена Политикой безопасности по-умолчанию!';
$_['error_checkout']          	= 'Эту страницу нельзя удалить, поскольку она назначена Условиями соглашения по-умолчанию!';
$_['error_affiliate']          	= 'Страница не может быть удалена, поскольку она используется в условиях партнерской программы!';
$_['error_return']          	= 'Внимание! Эта информационная страница не может быть удалена, так как сейчас используется в магазине в качестве условий возврата!';
$_['error_store']          		= 'Страница не может быть удалена, поскольку она используется в %s магазинах!';

$_['error_values']          		= 'Заполнены не все поля';
$_['error_limit']          		= 'Укажите лимит вывода материалов';
$_['error_size']          		= 'Укажите размеры изображений';
