<?php
// Heading
$_['heading_title']         = 'Авторы / Читатели';

// Tab
$_['tab_general']          = 'Общие';
$_['tab_fields']          = 'Характеристики';

// Text
$_['text_success']          = 'Информация о пользователе успешно изменена!';
$_['text_list']             = 'Список пользователей';
$_['text_add']              = 'Добавление пользователя';
$_['text_edit']             = 'Редактирование пользователя';
$_['text_default']          = 'По умолчанию';
$_['text_exp_add']          = 'Добавить должность';

$_['confirm_exp_remove']    = 'Вы уверены, что хотите удалить должность? Действие не обратимо и должность будет удалена во всех связанных материалах!';

// Column
$_['column_name']           = 'Имя пользователя';
$_['column_email']          = 'E-Mail';
$_['column_status']         = 'Статус';
$_['column_comment']        = 'Комментарий';
$_['column_exp']        		= 'Должность';
$_['column_description']    = 'Описания';
$_['column_action']         = 'Действие';

// Entry
$_['entry_name']       			= 'ФИО';
$_['entry_firstname']       = 'Имя';
$_['entry_lastname']       	= 'Фамилия';
$_['entry_email']           = 'E-Mail';
$_['entry_image']           = 'Аватар';
$_['entry_exp']           	= 'Должность';
$_['entry_status']          = 'Статус';
$_['entry_password']        = 'Пароль';
$_['entry_confirm']         = 'Подтверждение';
$_['entry_comment']         = 'Комментарий';
$_['entry_description']     = 'Описания';
$_['entry_name']            = 'Имя пользователя';
$_['entry_event']          		= 'Мероприятия:';
$_['entry_event_placeholder']          	= 'Начните вводить название мероприятия:';
$_['entry_company']          		= 'Компания:';
$_['entry_company_placeholder']          		= 'Начните вводить название компании здесь';
$_['entry_tag']          			= 'Экспертность:';
$_['entry_tag_placeholder']          			= 'Начните писать значение тега здесь';
$_['entry_expert']          			= 'Тип пользователя';
$_['entry_b24id']          			= 'ID эксперта Б24 для синхронизации';
$_['entry_emails']          			= 'Рабочие e-mail для экспертов через запятую';
$_['entry_keyword']          	= 'SEO URL:';

$_['entry_field_expertise']          	= 'Экпертиза:';
$_['entry_field_useful']          	= 'Чем могу быть полезен:';
$_['entry_field_regalia']          	= 'Заслуги и решгалии:';

// Error
$_['error_warning']         = 'Внимание: проверьте форму на наличие ошибок!';
$_['error_permission']      = 'Внимание: вы не имеете доступ к изменению информации о пользователях!';
$_['error_exists']          = 'Внимание: адрес электронной почты уже зарегистрирован!';
$_['error_name']     				= 'Имя должно быть от 1 до 64 символов!';
$_['error_firstname']     	= 'Имя должно быть от 1 до 64 символов!';
$_['error_lastname']     		= 'Фамилия должна быть от 1 до 64 символов!';
$_['error_email']           = 'Неверный адрес электронной почты!';
$_['error_password']        = 'Пароль должен быть от 4 до 20 символов!';
$_['error_confirm']         = 'Пароль и подтверждение пароля не совпадают!';
$_['error_delete_exp']         = 'Вы не можете удалить эту должность';
$_['error_keyword']          	= 'Этот SEO keyword уже используется!';

// Help
$_['help_keyword']          	= 'Используйте тире вместо пробелов. Должно быть уникально на всю систему';