<?php
// Heading
$_['heading_title']          	= 'Импорт';

// Text
$_['text_success']          	= 'Изменения успешно внесены!';
$_['text_list']          		= 'Список материалов';
$_['text_add']          		= 'Добавление материала';
$_['text_edit']          		= 'Редактирование материала';
$_['text_default']          	= 'Основной магазин';

// Column
$_['column_title']          	= 'Заголовок материала';
$_['column_sort_order']         = 'Порядок сортировки';
$_['column_action']          	= 'Действие';
$_['column_date_available']          	= 'Дата создания';

// Tab
$_['tab_copy']      = 'Копирайт';
$_['tab_gallery']      = 'Галереи';

// Entry
$_['entry_meta_description']      = 'Текст:';
$_['entry_meta_title']          = 'HTML-тег Title';
$_['entry_meta_h1']             = 'HTML-тег H1';
$_['entry_meta_keyword']        = 'Мета-тег Keywords:';
$_['entry_meta_description']    = 'Мета-тег Description:';


$_['entry_date_available']          		= 'Дата публикации:';
$_['entry_title']          		= 'Заголовок:';
$_['entry_description']         = 'Описание:';
$_['entry_preview']         = 'Превью:';
$_['entry_master']         = 'Связанный мастер-класс:';
$_['entry_master_default']         = '-- Не выбрано --';
$_['entry_tag']         = 'Теги:';
$_['entry_tag_placeholder']         = 'Начните писать тег здесь:';
$_['entry_copy']         = 'Копирайт:';
$_['entry_copy_remove']         = 'Вы действительно хотите удалить копирайт?';
$_['entry_video']         = 'Видео YouTube';
$_['entry_master_old']         = 'Прошедший мастер-класс?';

$_['entry_keyword']          	= 'SEO URL:';
$_['entry_bottom']          	= 'Отображать в футере:';
$_['entry_status']          	= 'Статус:';
$_['entry_sort_order']          = 'Порядок сортировки:';
$_['entry_layout']          	= 'Выберите макет:';
$_['entry_image']          	= 'Изображение:';
$_['entry_author']          	= 'Автор:';
$_['entry_author_placeholder']          	= 'Начните писать имя автора здесь';

// Help
$_['help_keyword']          	= 'Используйте тире вместо пробелов. Должно быть уникально на всю систему';
$_['help_bottom']          		= 'Показать в футере';
$_['help_input_master']       = 'Используйте конструкцию <strong>[master]</strong> в том месте, где хотите вывести связанный мастер-класс';

// Error
$_['error_warning']          	= 'Внимательно проверьте форму на ошибки!';
$_['error_permission']          = 'У вас нет прав для изменения статей!';
$_['error_title']          		= 'Заголовок статьи должно быть от 3 до 128 символов!';
$_['error_description']         = 'Описание должно быть не менее 3 символов!';
$_['error_meta_title']          = 'Мета-тег Title должен быть от 3 до 255 символов!';
$_['error_keyword']          	= 'Этот SEO keyword уже используется!';
$_['error_account']          	= 'Эту страницу нельзя удалить, поскольку она назначена Политикой безопасности по-умолчанию!';
$_['error_checkout']          	= 'Эту страницу нельзя удалить, поскольку она назначена Условиями соглашения по-умолчанию!';
$_['error_affiliate']          	= 'Страница не может быть удалена, поскольку она используется в условиях партнерской программы!';
$_['error_return']          	= 'Внимание! Эта информационная страница не может быть удалена, так как сейчас используется в магазине в качестве условий возврата!';
$_['error_store']          		= 'Страница не может быть удалена, поскольку она используется в %s магазинах!';

$_['error_values']          		= 'Заполнены не все поля';
$_['error_limit']          		= 'Укажите лимит вывода материалов';
$_['error_size']          		= 'Укажите размеры изображений';
$_['error_author']          	= 'Укажите автора материала!';
$_['error_link']          	= 'Укажите ссылку на спецпроект!';


$_['tab_case']          		= 'Кейс';
$_['case_title']          	= 'Интегратор';
$_['case_description']     	= 'Описание';
$_['case_logo']          		= 'Логотип';
$_['case_template']       	= 'Шаблон';
$_['case_template_simple']  = 'Краткий';
$_['case_template_full']    = 'Полный';
$_['case_catalog']    			= 'Показывать в общем списке?';
$_['case_attr']          		= 'Атрибуты';
$_['case_text']          		= 'Значение';
$_['case_remove']          	= 'Вы действительно хотите удалить атрибут кейса?';