<?php
// Heading
$_['heading_title']          	= 'Размеры изображений';

// Text
$_['text_success']          	= 'Изменения успешно внесены!';
$_['text_list']          		= 'Список материалов';
$_['text_add']          		= 'Добавление материала';
$_['text_edit']          		= 'Редактирование материала';
$_['text_default']          	= 'Основной магазин';

// Column
$_['column_title']          	= 'Заголовок материала';
$_['column_sort_order']         = 'Порядок сортировки';
$_['column_action']          	= 'Действие';


$_['error_warning']          	= 'Внимательно проверьте форму на ошибки!';
$_['error_permission']          = 'У вас нет прав для изменения настроек!';
$_['error_values']          		= 'Заполнены не все поля';
$_['error_size']          		= 'Укажите размеры изображений';
